Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_regdef.h
/** \brief  Group, Channel Control Register */
typedef struct _Ifx_EVADC_G_CHCTR_Bits
{
    unsigned int ICLSEL:2;                  /**< \brief [1:0] Input Class Select (rw) */
    unsigned int reserved_2:2;              /**< \brief \internal Reserved */
    unsigned int BNDSELL:2;                 /**< \brief [5:4] Lower Boundary Select (rw) */
    unsigned int BNDSELU:2;                 /**< \brief [7:6] Upper Boundary Select (rw) */
    unsigned int CHEVMODE:2;                /**< \brief [9:8] Channel Event Mode (rw) */
    unsigned int SYNC:1;                    /**< \brief [10:10] Synchronization Request (rw) */
    unsigned int REFSEL:1;                  /**< \brief [11:11] Reference Input Selection (rw) */
    unsigned int BNDSELX:4;                 /**< \brief [15:12] BoundaryExtension (rw) */
    unsigned int RESREG:4;                  /**< \brief [19:16] Result Register (rw) */
    unsigned int RESTGT:1;                  /**< \brief [20:20] Result Target (rw) */
    unsigned int RESPOS:1;                  /**< \brief [21:21] Result Position (rw) */
    unsigned int reserved_22:6;             /**< \brief \internal Reserved */
    unsigned int BWDCH:2;                   /**< \brief [29:28] Broken Wire Detection Channel (rw) */
    unsigned int BWDEN:1;                   /**< \brief [30:30] Broken Wire Detection Enable (rw) */
    unsigned int reserved_31:1;             /**< \brief \internal Reserved */
} Ifx_EVADC_G_CHCTR_Bits;

/** \brief  Clock Control Register */
typedef struct _Ifx_EVADC_CLC_Bits
{
    unsigned int DISR:1;                    /**< \brief [0:0] Module Disable Request Bit (rw) */
    unsigned int DISS:1;                    /**< \brief [1:1] Module Disable Status Bit (rh) */
    unsigned int reserved_2:1;              /**< \brief \internal Reserved */
    unsigned int EDIS:1;                    /**< \brief [3:3] Sleep Mode Enable Control (rw) */
    unsigned int reserved_4:28;             /**< \brief \internal Reserved */
} Ifx_EVADC_CLC_Bits;

/** \brief  External Multiplexer Interface Select Register */
typedef struct _Ifx_EVADC_EMUXSEL_Bits
{
    unsigned int EMUXGRP0:4;                /**< \brief [3:0] External Multiplexer Group for Interface 0 (rw) */
    unsigned int EMUXGRP1:4;                /**< \brief [7:4] External Multiplexer Group for Interface 1 (rw) */
    unsigned int reserved_8:24;             /**< \brief \internal Reserved */
} Ifx_EVADC_EMUXSEL_Bits;

/** \brief  Boundary Flag Register, Group */
typedef struct _Ifx_EVADC_FCG_FCBFL_Bits
{
    unsigned int BFL:1;                     /**< \brief [0:0] Boundary Flag (rh) */
    unsigned int reserved_1:3;              /**< \brief \internal Reserved */
    unsigned int BFA:1;                     /**< \brief [4:4] Boundary Flag Activation Select (rw) */
    unsigned int reserved_5:3;              /**< \brief \internal Reserved */
    unsigned int BFI:1;                     /**< \brief [8:8] Boundary Flag Inversion Control (rw) */
    unsigned int reserved_9:3;              /**< \brief \internal Reserved */
    unsigned int BFS:2;                     /**< \brief [13:12] Boundary Flag Software Control (rw) */
    unsigned int reserved_14:2;             /**< \brief \internal Reserved */
    unsigned int BFM:1;                     /**< \brief [16:16] Boundary Flag Mode Control (rw) */
    unsigned int BFV:1;                     /**< \brief [17:17] Boundary Flag Value (rw) */
    unsigned int reserved_18:6;             /**< \brief \internal Reserved */
    unsigned int BFLNP:4;                   /**< \brief [27:24] Boundary Flag Node Pointer (rw) */
    unsigned int FCR:1;                     /**< \brief [28:28] Fast Compare Result (r) */
    unsigned int reserved_29:2;             /**< \brief \internal Reserved */
    unsigned int VF:1;                      /**< \brief [31:31] Valid Flag (rh) */
} Ifx_EVADC_FCG_FCBFL_Bits;

/** \brief  Fast Compare Control Register, Group */
typedef struct _Ifx_EVADC_FCG_FCCTRL_Bits
{
    unsigned int STCF:5;                    /**< \brief [4:0] Sample Time Control for Fast Comparisons (rw) */
    unsigned int reserved_5:1;              /**< \brief \internal Reserved */
    unsigned int AIPF:2;                    /**< \brief [7:6] Analog Input Precharge Enable for Fast Comparisons (rw) */
    unsigned int CHEVMODE:2;                /**< \brief [9:8] Channel Event Mode (rw) */
    unsigned int DIVA:5;                    /**< \brief [14:10] Divider Factor for the Analog Internal Clock (rw) */
    unsigned int CPWC:1;                    /**< \brief [15:15] Write Control for Control Parameters (w) */
    unsigned int XTSEL:4;                   /**< \brief [19:16] External Trigger Input Selection (rw) */
    unsigned int XTLVL:1;                   /**< \brief [20:20] External Trigger Level (rh) */
    unsigned int XTMODE:2;                  /**< \brief [22:21] Trigger Operating Mode (rw) */
    unsigned int XTPOL:1;                   /**< \brief [23:23] External Trigger Polarity (rw) */
    unsigned int GTMODE:2;                  /**< \brief [25:24] Gate Operating Mode (rw) */
    unsigned int FCCHNR:5;                  /**< \brief [30:26] Fast Compare Channel: Cannel Number (rw) */
    unsigned int XTWC:1;                    /**< \brief [31:31] Write Control for Trigger/Gate Configuration (w) */
} Ifx_EVADC_FCG_FCCTRL_Bits;

/** \brief  Fast Comp. Hysteresis Register, Group */
typedef struct _Ifx_EVADC_FCG_FCHYST_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int DELTAMINUS:10;             /**< \brief [11:2] Lower Delta Value (rw) */
    unsigned int reserved_12:6;             /**< \brief \internal Reserved */
    unsigned int DELTAPLUS:10;              /**< \brief [27:18] Upper Delta Value (rw) */
    unsigned int reserved_28:4;             /**< \brief \internal Reserved */
} Ifx_EVADC_FCG_FCHYST_Bits;

/** \brief  Fast Compare Mode Register, Group */
typedef struct _Ifx_EVADC_FCG_FCM_Bits
{
    unsigned int RUNCOMP:2;                 /**< \brief [1:0] Run Control for Compare Channel (rw) */
    unsigned int RUNRAMP:2;                 /**< \brief [3:2] Run Control for Ramp (rw) */
    unsigned int FCRDIR:1;                  /**< \brief [4:4] Fast Compare Ramp Direction (rw) */
    unsigned int ANON:1;                    /**< \brief [5:5] Analog Converter Control (rw) */
    unsigned int reserved_6:2;              /**< \brief \internal Reserved */
    unsigned int FCTRIV:8;                  /**< \brief [15:8] Fast Compare Trigger Interval (rw) */
    unsigned int SRG:2;                     /**< \brief [17:16] Service Request Generation (rw) */
    unsigned int AUE:2;                     /**< \brief [19:18] Automatic Update Enable (rw) */
    unsigned int reserved_20:1;             /**< \brief \internal Reserved */
    unsigned int FCMWC:1;                   /**< \brief [21:21] Write Control for Fast Compare Mode Configuration (w) */
    unsigned int FCREF:10;                  /**< \brief [31:22] Fast Compare Reference Value (rwh) */
} Ifx_EVADC_FCG_FCM_Bits;

/** \brief  Fast Compare Ramp Register 0, Group */
typedef struct _Ifx_EVADC_FCG_FCRAMP0_Bits
{
    unsigned int FCRCOMPA:10;               /**< \brief [9:0] Fast Compare Ramp Compare Value A (rw) */
    unsigned int reserved_10:6;             /**< \brief \internal Reserved */
    unsigned int FCRSTEP:8;                 /**< \brief [23:16] Fast Compare Ramp Step Width (rw) */
    unsigned int reserved_24:7;             /**< \brief \internal Reserved */
    unsigned int FSWC:1;                    /**< \brief [31:31] Write Control for Fast Compare Stepwidth (w) */
} Ifx_EVADC_FCG_FCRAMP0_Bits;

/** \brief  Fast Compare Ramp Register 1, Group */
typedef struct _Ifx_EVADC_FCG_FCRAMP1_Bits
{
    unsigned int FCRCOMPB:10;               /**< \brief [9:0] Fast Compare Ramp Compare Value B (rw) */
    unsigned int reserved_10:22;            /**< \brief \internal Reserved */
} Ifx_EVADC_FCG_FCRAMP1_Bits;

/** \brief  Alias Register, Group */
typedef struct _Ifx_EVADC_G_ALIAS_Bits
{
    unsigned int ALIAS0:5;                  /**< \brief [4:0] Alias Value for CH0 Conversion Requests (rw) */
    unsigned int reserved_5:3;              /**< \brief \internal Reserved */
    unsigned int ALIAS1:5;                  /**< \brief [12:8] Alias Value for CH1 Conversion Requests (rw) */
    unsigned int reserved_13:19;            /**< \brief \internal Reserved */
} Ifx_EVADC_G_ALIAS_Bits;

/** \brief  Analog Fct. Config. Register, Group */
typedef struct _Ifx_EVADC_G_ANCFG_Bits
{
    unsigned int IPE:1;                     /**< \brief [0:0] Idle Precharge Enable (rw) */
    unsigned int BE:1;                      /**< \brief [1:1] Input Buffer Enable (rw) */
    unsigned int RPE:1;                     /**< \brief [2:2] Reference Precharge Enable (rw) */
    unsigned int RPC:1;                     /**< \brief [3:3] Reference Precharge Control (rw) */
    unsigned int CALSTC:2;                  /**< \brief [5:4] Calibration Sample Time Control (rw) */
    unsigned int DPCAL:1;                   /**< \brief [6:6] Disable Post-Calibration (rw) */
    unsigned int reserved_7:9;              /**< \brief \internal Reserved */
    unsigned int ACSD:3;                    /**< \brief [18:16] Analog Clock Synchronization Delay (rw) */
    unsigned int SSE:1;                     /**< \brief [19:19] Sample Synchronization Enable (rw) */
    unsigned int DIVA:5;                    /**< \brief [24:20] Divider Factor for the Analog Internal Clock (rw) */
    unsigned int DCMSB:1;                   /**< \brief [25:25] Double Clock for the MSB Conversion (rw) */
    unsigned int reserved_26:6;             /**< \brief \internal Reserved */
} Ifx_EVADC_G_ANCFG_Bits;

/** \brief  Arbitration Config. Register, Group */
typedef struct _Ifx_EVADC_G_ARBCFG_Bits
{
    unsigned int ANONC:2;                   /**< \brief [1:0] Analog Converter Control (rw) */
    unsigned int reserved_2:2;              /**< \brief \internal Reserved */
    unsigned int ARBRND:2;                  /**< \brief [5:4] Arbitration Round Length (rw) */
    unsigned int reserved_6:1;              /**< \brief \internal Reserved */
    unsigned int ARBM:1;                    /**< \brief [7:7] Arbitration Mode (rw) */
    unsigned int reserved_8:8;              /**< \brief \internal Reserved */
    unsigned int ANONS:2;                   /**< \brief [17:16] Analog Converter Control Status (rh) */
    unsigned int CSRC:2;                    /**< \brief [19:18] Currently Converted Request Source (rh) */
    unsigned int CHNR:5;                    /**< \brief [24:20] Channel Number (rh) */
    unsigned int SYNRUN:1;                  /**< \brief [25:25] Synchronous Conversion Running (rh) */
    unsigned int reserved_26:2;             /**< \brief \internal Reserved */
    unsigned int CAL:1;                     /**< \brief [28:28] Start-Up Calibration Active Indication (rh) */
    unsigned int reserved_29:1;             /**< \brief \internal Reserved */
    unsigned int BUSY:1;                    /**< \brief [30:30] Converter Busy Flag (rh) */
    unsigned int SAMPLE:1;                  /**< \brief [31:31] Sample Phase Flag (rh) */
} Ifx_EVADC_G_ARBCFG_Bits;

/** \brief  Arbitration Priority Register, Group */
typedef struct _Ifx_EVADC_G_ARBPR_Bits
{
    unsigned int PRIO0:2;                   /**< \brief [1:0] Priority of Request Source 0 (rw) */
    unsigned int reserved_2:1;              /**< \brief \internal Reserved */
    unsigned int CSM0:1;                    /**< \brief [3:3] Conversion Start Mode of Request Source 0 (rw) */
    unsigned int PRIO1:2;                   /**< \brief [5:4] Priority of Request Source 1 (rw) */
    unsigned int reserved_6:1;              /**< \brief \internal Reserved */
    unsigned int CSM1:1;                    /**< \brief [7:7] Conversion Start Mode of Request Source 1 (rw) */
    unsigned int PRIO2:2;                   /**< \brief [9:8] Priority of Request Source 2 (rw) */
    unsigned int reserved_10:1;             /**< \brief \internal Reserved */
    unsigned int CSM2:1;                    /**< \brief [11:11] Conversion Start Mode of Request Source 2 (rw) */
    unsigned int reserved_12:12;            /**< \brief \internal Reserved */
    unsigned int ASEN0:1;                   /**< \brief [24:24] Arbitration Slot 0 Enable (rw) */
    unsigned int ASEN1:1;                   /**< \brief [25:25] Arbitration Slot 1 Enable (rw) */
    unsigned int ASEN2:1;                   /**< \brief [26:26] Arbitration Slot 2 Enable (rw) */
    unsigned int reserved_27:5;             /**< \brief \internal Reserved */
} Ifx_EVADC_G_ARBPR_Bits;

