Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_regdef.h
/** \brief  Boundary Select Register, Group */
typedef struct _Ifx_EVADC_G_BOUND_Bits
{
    unsigned int BOUNDARY0:12;              /**< \brief [11:0] Boundary Value 0 for Limit Checking (rw) */
    unsigned int reserved_12:4;             /**< \brief \internal Reserved */
    unsigned int BOUNDARY1:12;              /**< \brief [27:16] Boundary Value 1 for Limit Checking (rw) */
    unsigned int reserved_28:4;             /**< \brief \internal Reserved */
} Ifx_EVADC_G_BOUND_Bits;

/** \brief  Channel Event Flag Clear Register, Group */
typedef struct _Ifx_EVADC_G_CEFCLR_Bits
{
    unsigned int CEV0:1;                    /**< \brief [0:0] Clear Channel Event for Channel 0 (w) */
    unsigned int CEV1:1;                    /**< \brief [1:1] Clear Channel Event for Channel 1 (w) */
    unsigned int CEV2:1;                    /**< \brief [2:2] Clear Channel Event for Channel 2 (w) */
    unsigned int CEV3:1;                    /**< \brief [3:3] Clear Channel Event for Channel 3 (w) */
    unsigned int CEV4:1;                    /**< \brief [4:4] Clear Channel Event for Channel 4 (w) */
    unsigned int CEV5:1;                    /**< \brief [5:5] Clear Channel Event for Channel 5 (w) */
    unsigned int CEV6:1;                    /**< \brief [6:6] Clear Channel Event for Channel 6 (w) */
    unsigned int CEV7:1;                    /**< \brief [7:7] Clear Channel Event for Channel 7 (w) */
    unsigned int CEV8:1;                    /**< \brief [8:8] Clear Channel Event for Channel 8 (w) */
    unsigned int CEV9:1;                    /**< \brief [9:9] Clear Channel Event for Channel 9 (w) */
    unsigned int CEV10:1;                   /**< \brief [10:10] Clear Channel Event for Channel 10 (w) */
    unsigned int CEV11:1;                   /**< \brief [11:11] Clear Channel Event for Channel 11 (w) */
    unsigned int CEV12:1;                   /**< \brief [12:12] Clear Channel Event for Channel 12 (w) */
    unsigned int CEV13:1;                   /**< \brief [13:13] Clear Channel Event for Channel 13 (w) */
    unsigned int CEV14:1;                   /**< \brief [14:14] Clear Channel Event for Channel 14 (w) */
    unsigned int CEV15:1;                   /**< \brief [15:15] Clear Channel Event for Channel 15 (w) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_EVADC_G_CEFCLR_Bits;

/** \brief  Channel Event Flag Register, Group */
typedef struct _Ifx_EVADC_G_CEFLAG_Bits
{
    unsigned int CEV0:1;                    /**< \brief [0:0] Channel Event for Channel 0 (rwh) */
    unsigned int CEV1:1;                    /**< \brief [1:1] Channel Event for Channel 1 (rwh) */
    unsigned int CEV2:1;                    /**< \brief [2:2] Channel Event for Channel 2 (rwh) */
    unsigned int CEV3:1;                    /**< \brief [3:3] Channel Event for Channel 3 (rwh) */
    unsigned int CEV4:1;                    /**< \brief [4:4] Channel Event for Channel 4 (rwh) */
    unsigned int CEV5:1;                    /**< \brief [5:5] Channel Event for Channel 5 (rwh) */
    unsigned int CEV6:1;                    /**< \brief [6:6] Channel Event for Channel 6 (rwh) */
    unsigned int CEV7:1;                    /**< \brief [7:7] Channel Event for Channel 7 (rwh) */
    unsigned int CEV8:1;                    /**< \brief [8:8] Channel Event for Channel 8 (rwh) */
    unsigned int CEV9:1;                    /**< \brief [9:9] Channel Event for Channel 9 (rwh) */
    unsigned int CEV10:1;                   /**< \brief [10:10] Channel Event for Channel 10 (rwh) */
    unsigned int CEV11:1;                   /**< \brief [11:11] Channel Event for Channel 11 (rwh) */
    unsigned int CEV12:1;                   /**< \brief [12:12] Channel Event for Channel 12 (rwh) */
    unsigned int CEV13:1;                   /**< \brief [13:13] Channel Event for Channel 13 (rwh) */
    unsigned int CEV14:1;                   /**< \brief [14:14] Channel Event for Channel 14 (rwh) */
    unsigned int CEV15:1;                   /**< \brief [15:15] Channel Event for Channel 15 (rwh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_EVADC_G_CEFLAG_Bits;

/** \brief  Channel Event Node Pointer Reg. 0, Group */
typedef struct _Ifx_EVADC_G_CEVNP0_Bits
{
    unsigned int CEV0NP:4;                  /**< \brief [3:0] Service Request Node Pointer Channel Event 0 (rw) */
    unsigned int CEV1NP:4;                  /**< \brief [7:4] Service Request Node Pointer Channel Event 1 (rw) */
    unsigned int CEV2NP:4;                  /**< \brief [11:8] Service Request Node Pointer Channel Event 2 (rw) */
    unsigned int CEV3NP:4;                  /**< \brief [15:12] Service Request Node Pointer Channel Event 3 (rw) */
    unsigned int CEV4NP:4;                  /**< \brief [19:16] Service Request Node Pointer Channel Event 4 (rw) */
    unsigned int CEV5NP:4;                  /**< \brief [23:20] Service Request Node Pointer Channel Event 5 (rw) */
    unsigned int CEV6NP:4;                  /**< \brief [27:24] Service Request Node Pointer Channel Event 6 (rw) */
    unsigned int CEV7NP:4;                  /**< \brief [31:28] Service Request Node Pointer Channel Event 7 (rw) */
} Ifx_EVADC_G_CEVNP0_Bits;

/** \brief Channel Event Node Pointer Register 1, Group  */
typedef struct _Ifx_EVADC_G_CEVNP1_Bits
{
    unsigned int  CEV8NP:4;          /**< \brief [3:0] Service Request Node Pointer Channel Event i - CEV8NP,CEV9NP,CEV10NP,CEV11NP,CEV12NP,CEV13NP,CEV14NP,CEV15NP (rw) */
    unsigned int  CEV9NP:4;          /**< \brief [7:4] Service Request Node Pointer Channel Event i - CEV8NP,CEV9NP,CEV10NP,CEV11NP,CEV12NP,CEV13NP,CEV14NP,CEV15NP (rw) */
    unsigned int  CEV10NP:4;         /**< \brief [11:8] Service Request Node Pointer Channel Event i - CEV8NP,CEV9NP,CEV10NP,CEV11NP,CEV12NP,CEV13NP,CEV14NP,CEV15NP (rw) */
    unsigned int  CEV11NP:4;         /**< \brief [15:12] Service Request Node Pointer Channel Event i - CEV8NP,CEV9NP,CEV10NP,CEV11NP,CEV12NP,CEV13NP,CEV14NP,CEV15NP (rw) */
    unsigned int  CEV12NP:4;         /**< \brief [19:16] Service Request Node Pointer Channel Event i - CEV8NP,CEV9NP,CEV10NP,CEV11NP,CEV12NP,CEV13NP,CEV14NP,CEV15NP (rw) */
    unsigned int  CEV13NP:4;         /**< \brief [23:20] Service Request Node Pointer Channel Event i - CEV8NP,CEV9NP,CEV10NP,CEV11NP,CEV12NP,CEV13NP,CEV14NP,CEV15NP (rw) */
    unsigned int  CEV14NP:4;         /**< \brief [27:24] Service Request Node Pointer Channel Event i - CEV8NP,CEV9NP,CEV10NP,CEV11NP,CEV12NP,CEV13NP,CEV14NP,CEV15NP (rw) */
    unsigned int  CEV15NP:4;         /**< \brief [31:28] Service Request Node Pointer Channel Event i - CEV8NP,CEV9NP,CEV10NP,CEV11NP,CEV12NP,CEV13NP,CEV14NP,CEV15NP (rw) */
} Ifx_EVADC_G_CEVNP1_Bits;

/** \brief  Ext. Multiplexer Channel Select Reg., Group */
typedef struct _Ifx_EVADC_G_EMUXCS_Bits
{
    unsigned int EMUXCH:16;                 /**< \brief [15:0] External Multiplexer Channel Select (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_EVADC_G_EMUXCS_Bits;

/** \brief  External Multiplexer Control Reg., Group */
typedef struct _Ifx_EVADC_G_EMUXCTR_Bits
{
    unsigned int EMUXSET:3;                 /**< \brief [2:0] External Multiplexer Start Selection (rw) */
    unsigned int reserved_3:1;              /**< \brief \internal Reserved */
    unsigned int EMUXMODE:3;                /**< \brief [6:4] External Multiplexer Mode (rw) */
    unsigned int reserved_7:5;              /**< \brief \internal Reserved */
    unsigned int EMXCOD:1;                  /**< \brief [12:12] External Multiplexer Coding Scheme (rw) */
    unsigned int EMXST:1;                   /**< \brief [13:13] External Multiplexer Sample Time Control (rw) */
    unsigned int EMXCSS:1;                  /**< \brief [14:14] External Multiplexer Channel Selection Style (rw) */
    unsigned int EMXWC:1;                   /**< \brief [15:15] Write Control for EMUX Configuration (w) */
    unsigned int EMUXACT:3;                 /**< \brief [18:16] External Multiplexer Actual Selection (rh) */
    unsigned int reserved_19:1;             /**< \brief \internal Reserved */
    unsigned int EMUXCCB:5;                 /**< \brief [24:20] External Multiplexer Channel Selection for Block Mode (rw) */
    unsigned int reserved_25:7;             /**< \brief \internal Reserved */
} Ifx_EVADC_G_EMUXCTR_Bits;

/** \brief  Input Class Reg0ster i, Group 0 */
typedef struct _Ifx_EVADC_G_ICLASS_Bits
{
    unsigned int STCS:5;                    /**< \brief [4:0] Sample Time Control for Standard Conversions (rw) */
    unsigned int reserved_5:1;              /**< \brief \internal Reserved */
    unsigned int AIPS:2;                    /**< \brief [7:6] Analog Input Precharge Control for Standard Conversions (rw) */
    unsigned int CMS:2;                     /**< \brief [9:8] Conversion Mode for Standard Conversions (rw) */
    unsigned int SESPS:1;                   /**< \brief [10:10] Spread Early Sample Point for Standard Conversions (rw) */
    unsigned int reserved_11:5;             /**< \brief \internal Reserved */
    unsigned int STCE:5;                    /**< \brief [20:16] Sample Time Control for EMUX Conversions (rw) */
    unsigned int reserved_21:1;             /**< \brief \internal Reserved */
    unsigned int AIPE:2;                    /**< \brief [23:22] Analog Input Precharge Control for EMUX Conversions (rw) */
    unsigned int CME:2;                     /**< \brief [25:24] Conversion Mode for EMUX Conversions (rw) */
    unsigned int SESPE:1;                   /**< \brief [26:26] Spread Early Sample Point for EMUX Conversions (rw) */
    unsigned int reserved_27:5;             /**< \brief \internal Reserved */
} Ifx_EVADC_G_ICLASS_Bits;

