Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_regdef.h
/** \brief  Service Request Software Activation Trigger, Group */
typedef struct _Ifx_EVADC_G_SRACT_Bits
{
    unsigned int AGSR0:1;                   /**< \brief [0:0] Activate Group Service Request Node 0 (w) */
    unsigned int AGSR1:1;                   /**< \brief [1:1] Activate Group Service Request Node 1 (w) */
    unsigned int AGSR2:1;                   /**< \brief [2:2] Activate Group Service Request Node 2 (w) */
    unsigned int AGSR3:1;                   /**< \brief [3:3] Activate Group Service Request Node 3 (w) */
    unsigned int reserved_4:4;              /**< \brief \internal Reserved */
    unsigned int ASSR0:1;                   /**< \brief [8:8] Activate Shared Service Request Node 0 (w) */
    unsigned int ASSR1:1;                   /**< \brief [9:9] Activate Shared Service Request Node 1 (w) */
    unsigned int ASSR2:1;                   /**< \brief [10:10] Activate Shared Service Request Node 2 (w) */
    unsigned int ASSR3:1;                   /**< \brief [11:11] Activate Shared Service Request Node 3 (w) */
    unsigned int reserved_12:20;            /**< \brief \internal Reserved */
} Ifx_EVADC_G_SRACT_Bits;

/** \brief  Synchronization Control Register, Group */
typedef struct _Ifx_EVADC_G_SYNCTR_Bits
{
    unsigned int STSEL:2;                   /**< \brief [1:0] Start Selection (rw) */
    unsigned int reserved_2:2;              /**< \brief \internal Reserved */
    unsigned int EVALR1:1;                  /**< \brief [4:4] Evaluate Ready Input R1 (rw) */
    unsigned int EVALR2:1;                  /**< \brief [5:5] Evaluate Ready Input R2 (rw) */
    unsigned int EVALR3:1;                  /**< \brief [6:6] Evaluate Ready Input R3 (rw) */
    unsigned int reserved_7:25;             /**< \brief \internal Reserved */
} Ifx_EVADC_G_SYNCTR_Bits;

/** \brief  Valid Flag Register, Group */
typedef struct _Ifx_EVADC_G_VFR_Bits
{
    unsigned int VF0:1;                     /**< \brief [0:0] Valid Flag of Result Register x (rwh) */
    unsigned int VF1:1;                     /**< \brief [1:1] Valid Flag of Result Register x (rwh) */
    unsigned int VF2:1;                     /**< \brief [2:2] Valid Flag of Result Register x (rwh) */
    unsigned int VF3:1;                     /**< \brief [3:3] Valid Flag of Result Register x (rwh) */
    unsigned int VF4:1;                     /**< \brief [4:4] Valid Flag of Result Register x (rwh) */
    unsigned int VF5:1;                     /**< \brief [5:5] Valid Flag of Result Register x (rwh) */
    unsigned int VF6:1;                     /**< \brief [6:6] Valid Flag of Result Register x (rwh) */
    unsigned int VF7:1;                     /**< \brief [7:7] Valid Flag of Result Register x (rwh) */
    unsigned int VF8:1;                     /**< \brief [8:8] Valid Flag of Result Register x (rwh) */
    unsigned int VF9:1;                     /**< \brief [9:9] Valid Flag of Result Register x (rwh) */
    unsigned int VF10:1;                    /**< \brief [10:10] Valid Flag of Result Register x (rwh) */
    unsigned int VF11:1;                    /**< \brief [11:11] Valid Flag of Result Register x (rwh) */
    unsigned int VF12:1;                    /**< \brief [12:12] Valid Flag of Result Register x (rwh) */
    unsigned int VF13:1;                    /**< \brief [13:13] Valid Flag of Result Register x (rwh) */
    unsigned int VF14:1;                    /**< \brief [14:14] Valid Flag of Result Register x (rwh) */
    unsigned int VF15:1;                    /**< \brief [15:15] Valid Flag of Result Register x (rwh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_EVADC_G_VFR_Bits;

/** \brief  Global Boundary Select Register */
typedef struct _Ifx_EVADC_GLOB_BOUND_Bits
{
    unsigned int BOUNDARY0:12;              /**< \brief [11:0] Boundary Value 0 for Limit Checking (rw) */
    unsigned int reserved_12:4;             /**< \brief \internal Reserved */
    unsigned int BOUNDARY1:12;              /**< \brief [27:16] Boundary Value 1 for Limit Checking (rw) */
    unsigned int reserved_28:4;             /**< \brief \internal Reserved */
} Ifx_EVADC_GLOB_BOUND_Bits;

/** \brief  Global Event Flag Register */
typedef struct _Ifx_EVADC_GLOB_EFLAG_Bits
{
    unsigned int reserved_0:8;              /**< \brief \internal Reserved */
    unsigned int REVGLB:1;                  /**< \brief [8:8] Global Result Event (rwh) */
    unsigned int reserved_9:15;             /**< \brief \internal Reserved */
    unsigned int REVGLBCLR:1;               /**< \brief [24:24] Clear Global Result Event (w) */
    unsigned int reserved_25:7;             /**< \brief \internal Reserved */
} Ifx_EVADC_GLOB_EFLAG_Bits;

/** \brief  Global Event Node Pointer Register */
typedef struct _Ifx_EVADC_GLOB_EVNP_Bits
{
    unsigned int reserved_0:16;             /**< \brief \internal Reserved */
    unsigned int REV0NP:4;                  /**< \brief [19:16] Service Request Node Pointer Global Result (rw) */
    unsigned int reserved_20:12;            /**< \brief \internal Reserved */
} Ifx_EVADC_GLOB_EVNP_Bits;

/** \brief  Global Result Control Register */
typedef struct _Ifx_EVADC_GLOB_RCR_Bits
{
    unsigned int reserved_0:16;             /**< \brief \internal Reserved */
    unsigned int DRCTR:4;                   /**< \brief [19:16] Data Reduction Control (rw) */
    unsigned int reserved_20:4;             /**< \brief \internal Reserved */
    unsigned int WFR:1;                     /**< \brief [24:24] Wait-for-Read Mode Enable (rw) */
    unsigned int reserved_25:6;             /**< \brief \internal Reserved */
    unsigned int SRGEN:1;                   /**< \brief [31:31] Service Request Generation Enable (rw) */
} Ifx_EVADC_GLOB_RCR_Bits;

/** \brief  Global Result Register */
typedef struct _Ifx_EVADC_GLOB_RES_Bits
{
    unsigned int RESULT:16;                 /**< \brief [15:0] Result of most recent conversion (rwh) */
    unsigned int GNR:4;                     /**< \brief [19:16] Group Number (rh) */
    unsigned int CHNR:5;                    /**< \brief [24:20] Channel Number (rh) */
    unsigned int EMUX:3;                    /**< \brief [27:25] External Multiplexer Setting (rh) */
    unsigned int CRS:2;                     /**< \brief [29:28] Converted Request Source (rh) */
    unsigned int reserved_30:1;             /**< \brief \internal Reserved */
    unsigned int VF:1;                      /**< \brief [31:31] Valid Flag (rwh) */
} Ifx_EVADC_GLOB_RES_Bits;

/** \brief  Global Result Register, Debug */
typedef struct _Ifx_EVADC_GLOB_RESD_Bits
{
    unsigned int RESULT:16;                 /**< \brief [15:0] Result of most recent conversion (rwh) */
    unsigned int GNR:4;                     /**< \brief [19:16] Group Number (rh) */
    unsigned int CHNR:5;                    /**< \brief [24:20] Channel Number (rh) */
    unsigned int EMUX:3;                    /**< \brief [27:25] External Multiplexer Setting (rh) */
    unsigned int CRS:2;                     /**< \brief [29:28] Converted Request Source (rh) */
    unsigned int reserved_30:1;             /**< \brief \internal Reserved */
    unsigned int VF:1;                      /**< \brief [31:31] Valid Flag (rwh) */
} Ifx_EVADC_GLOB_RESD_Bits;

/** \brief  Global Test Enable Register */
typedef struct _Ifx_EVADC_GLOB_TE_Bits
{
    unsigned int TFEG0:1;                   /**< \brief [0:0] Test Function Enable for Group 0 (rw) */
    unsigned int TFEG1:1;                   /**< \brief [1:1] Test Function Enable for Group 1 (rw) */
    unsigned int TFEG2:1;                   /**< \brief [2:2] Test Function Enable for Group 2 (rw) */
    unsigned int TFEG3:1;                   /**< \brief [3:3] Test Function Enable for Group 3 (rw) */
    unsigned int TFEG4:1;                   /**< \brief [4:4] Test Function Enable for Group 4 (rw) */
    unsigned int TFEG5:1;                   /**< \brief [5:5] Test Function Enable for Group 5 (rw) */
    unsigned int TFEG6:1;                   /**< \brief [6:6] Test Function Enable for Group 6 (rw) */
    unsigned int TFEG7:1;                   /**< \brief [7:7] Test Function Enable for Group 7 (rw) */
    unsigned int TFEG8:1;                   /**< \brief [8:8] Test Function Enable for Group 8 (rw) */
    unsigned int TFEG9:1;                   /**< \brief [9:9] Test Function Enable for Group 9 (rw) */
    unsigned int TFEG10:1;                  /**< \brief [10:10] Test Function Enable for Group 10 (rw) */
    unsigned int TFEG11:1;                  /**< \brief [11:11] Test Function Enable for Group 11 (rw) */
    unsigned int reserved_12:20;            /**< \brief \internal Reserved */
} Ifx_EVADC_GLOB_TE_Bits;

/** \brief  Global Test Functions Register */
typedef struct _Ifx_EVADC_GLOB_TF_Bits
{
    unsigned int CDCH:4;                    /**< \brief [3:0] Conversion Diagnostics Channel (rw) */
    unsigned int CDGR:4;                    /**< \brief [7:4] Conversion Diagnostics Group (rw) */
    unsigned int CDEN:1;                    /**< \brief [8:8] Converter Diagnostics Enable (rw) */
    unsigned int CDSEL:2;                   /**< \brief [10:9] Converter Diagnostics Pull-Devices Select (rw) */
    unsigned int reserved_11:4;             /**< \brief \internal Reserved */
    unsigned int CDWC:1;                    /**< \brief [15:15] Write Control for Conversion Diagnostics (w) */
    unsigned int PDD:1;                     /**< \brief [16:16] Pull-Down Diagnostics Enable (rw) */
    unsigned int MDPD:1;                    /**< \brief [17:17] Multiplexer Diagnostics Pull-Devices Enable (rw) */
    unsigned int MDPU:1;                    /**< \brief [18:18] Multiplexer Diagnostics Pull-Devices Enable - MDPD,MDPU (rw) */
    unsigned int reserved_19:4;             /**< \brief \internal Reserved */
    unsigned int MDWC:1;                    /**< \brief [23:23] Write Control for Multiplexer Diagnostics (w) */
    unsigned int reserved_24:8;             /**< \brief \internal Reserved */
} Ifx_EVADC_GLOB_TF_Bits;

/** \brief  Global Configuration Register */
typedef struct _Ifx_EVADC_GLOBCFG_Bits
{
    unsigned int reserved_0:8;              /**< \brief \internal Reserved */
    unsigned int DIVD:2;                    /**< \brief [9:8] Divider Factor for the Arbiter Clock (rw) */
    unsigned int reserved_10:2;             /**< \brief \internal Reserved */
    unsigned int USC:1;                     /**< \brief [12:12] Unsynchronized Clock Generation (rw) */
    unsigned int SUPLEV:2;                  /**< \brief [14:13] Supply Voltage Level (rw) */
    unsigned int CPWC:1;                    /**< \brief [15:15] Write Control for Control Parameters (w) */
    unsigned int reserved_16:15;            /**< \brief \internal Reserved */
    unsigned int SUCAL:1;                   /**< \brief [31:31] Start-Up Calibration (w) */
} Ifx_EVADC_GLOBCFG_Bits;

