Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_regdef.h
/** \brief  Queue 0 Input Register, Group 0 */
typedef struct _Ifx_EVADC_G_Q_QINR_Bits
{
    unsigned int REQCHNR:5;                 /**< \brief [4:0] Request Channel Number (w) */
    unsigned int RF:1;                      /**< \brief [5:5] Refill (w) */
    unsigned int ENSI:1;                    /**< \brief [6:6] Enable Source Interrupt (w) */
    unsigned int EXTR:1;                    /**< \brief [7:7] External Trigger (w) */
    unsigned int reserved_8:1;              /**< \brief \internal Reserved */
    unsigned int PDD:1;                     /**< \brief [9:9] Pull-Down Diagnostics Enable (w) */
    unsigned int MDPD:1;                    /**< \brief [10:10] Multiplexer Diagnostics Pull-Devices Enable (w) */
    unsigned int MDPU:1;                    /**< \brief [11:11] Multiplexer Diagnostics Pull-Devices Enable - MDPD,MDPU (w) */
    unsigned int CDEN:1;                    /**< \brief [12:12] Converter Diagnostics Enable (w) */
    unsigned int CDSEL:2;                   /**< \brief [14:13] Converter Diagnostics Pull-Devices Select (w) */
    unsigned int reserved_15:17;            /**< \brief \internal Reserved */
} Ifx_EVADC_G_Q_QINR_Bits;

/** \brief  Queue 0 Mode Register, Group 0 */
typedef struct _Ifx_EVADC_G_Q_QMR_Bits
{
    unsigned int ENGT:2;                    /**< \brief [1:0] Enable Gate (rw) */
    unsigned int ENTR:1;                    /**< \brief [2:2] Enable External Trigger (rw) */
    unsigned int reserved_3:5;              /**< \brief \internal Reserved */
    unsigned int CLRV:1;                    /**< \brief [8:8] Clear Valid Bit (w) */
    unsigned int TREV:1;                    /**< \brief [9:9] Trigger Event (w) */
    unsigned int FLUSH:1;                   /**< \brief [10:10] Flush Queue (w) */
    unsigned int CEV:1;                     /**< \brief [11:11] Clear Event Flag (w) */
    unsigned int reserved_12:4;             /**< \brief \internal Reserved */
    unsigned int RPTDIS:1;                  /**< \brief [16:16] Repeat Disable (rw) */
    unsigned int reserved_17:15;            /**< \brief \internal Reserved */
} Ifx_EVADC_G_Q_QMR_Bits;

/** \brief  Queue 0 Status Register, Group 0 */
typedef struct _Ifx_EVADC_G_Q_QSR_Bits
{
    unsigned int FILL:4;                    /**< \brief [3:0] Filling Level for Queue (rh) */
    unsigned int reserved_4:1;              /**< \brief \internal Reserved */
    unsigned int EMPTY:1;                   /**< \brief [5:5] Queue Empty (rh) */
    unsigned int reserved_6:1;              /**< \brief \internal Reserved */
    unsigned int REQGT:1;                   /**< \brief [7:7] Request Gate Level (rh) */
    unsigned int EV:1;                      /**< \brief [8:8] Event Detected (rh) */
    unsigned int reserved_9:23;             /**< \brief \internal Reserved */
} Ifx_EVADC_G_Q_QSR_Bits;

/** \brief  Queue 0 Requ. Timer Mode Reg., Group 0 */
typedef struct _Ifx_EVADC_G_Q2_TRCTR_Bits
{
    unsigned int SEQMOD:6;                  /**< \brief [5:0] Trigger Sequence Counter (rw) */
    unsigned int reserved_6:8;              /**< \brief \internal Reserved */
    unsigned int QACT:1;                    /**< \brief [14:14] Queue Active (rw) */
    unsigned int OV:1;                      /**< \brief [15:15] Overflow Detected (w) */
    unsigned int TSCSET:6;                  /**< \brief [21:16] Trigger Sequence Counter Start Value (rw) */
    unsigned int reserved_22:2;             /**< \brief \internal Reserved */
    unsigned int ITSEL:2;                   /**< \brief [25:24] Internal Trigger Input Selection (rw) */
    unsigned int reserved_26:2;             /**< \brief \internal Reserved */
    unsigned int SRDIS:1;                   /**< \brief [28:28] Service Request Disable (rw) */
    unsigned int reserved_29:2;             /**< \brief \internal Reserved */
    unsigned int COV:1;                     /**< \brief [31:31] Clear Overflow Flag (rw) */	
} Ifx_EVADC_G_Q2_TRCTR_Bits;

/** \brief  Queue 0 Requ. Timer Mode Reg., Group 0 */
typedef struct _Ifx_EVADC_G_Q_REQTM_Bits
{
    unsigned int SEQMOD:2;                  /**< \brief [1:0] Sequence Mode (rw) */
    unsigned int reserved_2:4;              /**< \brief \internal Reserved */
    unsigned int SEQTIMSET:10;              /**< \brief [15:6] Sequence Timer, Set Value (rw) */
    unsigned int REQTS:1;                   /**< \brief [16:16] Request Timer Start Trigger (w) */
    unsigned int ENTR:1;                    /**< \brief [17:17] Enable External Trigger (rw) */
    unsigned int reserved_18:4;             /**< \brief \internal Reserved */
    unsigned int SEQTIMOFF:10;              /**< \brief [31:22] Sequence Timer, Switch Off Value (rw) */
} Ifx_EVADC_G_Q_REQTM_Bits;

/** \brief  Queue 0 Requ. Timer Status Reg., Group 0 */
typedef struct _Ifx_EVADC_G_Q_REQTS_Bits
{
    unsigned int reserved_0:6;              /**< \brief \internal Reserved */
    unsigned int SEQTIMER:10;               /**< \brief [15:6] Sequence Timer (rh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_EVADC_G_Q_REQTS_Bits;

/** \brief  Group Result Control Register */
typedef struct _Ifx_EVADC_G_RCR_Bits
{
    unsigned int reserved_0:16;             /**< \brief \internal Reserved */
    unsigned int DRCTR:4;                   /**< \brief [19:16] Data Reduction Control (rw) */
    unsigned int DMM:2;                     /**< \brief [21:20] Data Modification Mode (rw) */
    unsigned int reserved_22:2;             /**< \brief \internal Reserved */
    unsigned int WFR:1;                     /**< \brief [24:24] Wait-for-Read Mode Enable (rw) */
    unsigned int FEN:2;                     /**< \brief [26:25] FIFO Mode Enable (rw) */
    unsigned int reserved_27:4;             /**< \brief \internal Reserved */
    unsigned int SRGEN:1;                   /**< \brief [31:31] Service Request Generation Enable (rw) */
} Ifx_EVADC_G_RCR_Bits;

/** \brief  Group Result Register */
typedef struct _Ifx_EVADC_G_RES_Bits
{
    unsigned int RESULT:16;                 /**< \brief [15:0] Result of Most Recent Conversion (rwh) */
    unsigned int DRC:4;                     /**< \brief [19:16] Data Reduction Counter (rh) */
    unsigned int CHNR:5;                    /**< \brief [24:20] Channel Number (rh) */
    unsigned int EMUX:3;                    /**< \brief [27:25] External Multiplexer Setting (rh) */
    unsigned int CRS:2;                     /**< \brief [29:28] Converted Request Source (rh) */
    unsigned int reserved_30:1;             /**< \brief \internal Reserved */
    unsigned int VF:1;                      /**< \brief [31:31] Valid Flag (rh) */
} Ifx_EVADC_G_RES_Bits;

/** \brief  Group Result Reg., Debug */
typedef struct _Ifx_EVADC_G_RESD_Bits
{
    unsigned int RESULT:16;                 /**< \brief [15:0] Result of Most Recent Conversion (rh) */
    unsigned int DRC:4;                     /**< \brief [19:16] Data Reduction Counter (rh) */
    unsigned int CHNR:5;                    /**< \brief [24:20] Channel Number (rh) */
    unsigned int EMUX:3;                    /**< \brief [27:25] External Multiplexer Setting (rh) */
    unsigned int CRS:2;                     /**< \brief [29:28] Converted Request Source (rh) */
    unsigned int reserved_30:1;             /**< \brief \internal Reserved */
    unsigned int VF:1;                      /**< \brief [31:31] Valid Flag (rh) */
} Ifx_EVADC_G_RESD_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Evadc_union
 * \{  */

/** \brief  Access Enable Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_ACCEN0_Bits B;                /**< \brief Bitfield access */
} Ifx_EVADC_ACCEN0;

