Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_regdef.h
/** \brief  Access Enable Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_ACCEN1_Bits B;                /**< \brief Bitfield access */
} Ifx_EVADC_ACCEN1;

/** \brief  Access Protection Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_ACCPROT0_Bits B;              /**< \brief Bitfield access */
} Ifx_EVADC_ACCPROT0;

/** \brief  Access Protection Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_ACCPROT1_Bits B;              /**< \brief Bitfield access */
} Ifx_EVADC_ACCPROT1;

/** \brief  Access Protection Register 2 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_ACCPROT2_Bits B;              /**< \brief Bitfield access */
} Ifx_EVADC_ACCPROT2;

/** \brief  Group, Channel Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_G_CHCTR_Bits B;                 /**< \brief Bitfield access */
} Ifx_EVADC_G_CHCTR;

/** \brief  Clock Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_CLC_Bits B;                   /**< \brief Bitfield access */
} Ifx_EVADC_CLC;

/** \brief  External Multiplexer Interface Select Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_EMUXSEL_Bits B;               /**< \brief Bitfield access */
} Ifx_EVADC_EMUXSEL;

/** \brief  Boundary Flag Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_FCG_FCBFL_Bits B;             /**< \brief Bitfield access */
} Ifx_EVADC_FCG_FCBFL;

/** \brief  Fast Compare Control Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_FCG_FCCTRL_Bits B;            /**< \brief Bitfield access */
} Ifx_EVADC_FCG_FCCTRL;

/** \brief  Fast Comp. Hysteresis Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_FCG_FCHYST_Bits B;            /**< \brief Bitfield access */
} Ifx_EVADC_FCG_FCHYST;

/** \brief  Fast Compare Mode Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_FCG_FCM_Bits B;               /**< \brief Bitfield access */
} Ifx_EVADC_FCG_FCM;

/** \brief  Fast Compare Ramp Register 0, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_FCG_FCRAMP0_Bits B;           /**< \brief Bitfield access */
} Ifx_EVADC_FCG_FCRAMP0;

/** \brief  Fast Compare Ramp Register 1, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_FCG_FCRAMP1_Bits B;           /**< \brief Bitfield access */
} Ifx_EVADC_FCG_FCRAMP1;

/** \brief  Alias Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_G_ALIAS_Bits B;               /**< \brief Bitfield access */
} Ifx_EVADC_G_ALIAS;

/** \brief  Analog Fct. Config. Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_G_ANCFG_Bits B;               /**< \brief Bitfield access */
} Ifx_EVADC_G_ANCFG;

/** \brief  Arbitration Config. Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_G_ARBCFG_Bits B;              /**< \brief Bitfield access */
} Ifx_EVADC_G_ARBCFG;

/** \brief  Arbitration Priority Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_G_ARBPR_Bits B;               /**< \brief Bitfield access */
} Ifx_EVADC_G_ARBPR;

/** \brief  Boundary Select Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_G_BOUND_Bits B;               /**< \brief Bitfield access */
} Ifx_EVADC_G_BOUND;

/** \brief  Channel Event Flag Clear Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_G_CEFCLR_Bits B;              /**< \brief Bitfield access */
} Ifx_EVADC_G_CEFCLR;

/** \brief  Channel Event Flag Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_G_CEFLAG_Bits B;              /**< \brief Bitfield access */
} Ifx_EVADC_G_CEFLAG;

/** \brief  Channel Event Node Pointer Reg. 0, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_G_CEVNP0_Bits B;              /**< \brief Bitfield access */
} Ifx_EVADC_G_CEVNP0;

/** \brief Channel Event Node Pointer Register 1, Group    */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_EVADC_G_CEVNP1_Bits B;        /**< \brief Bitfield access */
} Ifx_EVADC_G_CEVNP1;

/** \brief  Ext. Multiplexer Channel Select Reg., Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_G_EMUXCS_Bits B;              /**< \brief Bitfield access */
} Ifx_EVADC_G_EMUXCS;

/** \brief  External Multiplexer Control Reg., Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_G_EMUXCTR_Bits B;             /**< \brief Bitfield access */
} Ifx_EVADC_G_EMUXCTR;

/** \brief  Input Class Reg0ster i, Group 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_G_ICLASS_Bits B;              /**< \brief Bitfield access */
} Ifx_EVADC_G_ICLASS;

