Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_regdef.h
/** \brief  Result Event Flag Clear Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_G_REFCLR_Bits B;              /**< \brief Bitfield access */
} Ifx_EVADC_G_REFCLR;

/** \brief  Result Event Flag Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_G_REFLAG_Bits B;              /**< \brief Bitfield access */
} Ifx_EVADC_G_REFLAG;

/** \brief  Result Event Node Pointer Reg. 0, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_G_REVNP0_Bits B;              /**< \brief Bitfield access */
} Ifx_EVADC_G_REVNP0;

/** \brief  Result Event Node Pointer Reg. 1, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_G_REVNP1_Bits B;              /**< \brief Bitfield access */
} Ifx_EVADC_G_REVNP1;

/** \brief  Source Event Flag Clear Reg., Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_G_SEFCLR_Bits B;              /**< \brief Bitfield access */
} Ifx_EVADC_G_SEFCLR;

/** \brief  Source Event Flag Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_G_SEFLAG_Bits B;              /**< \brief Bitfield access */
} Ifx_EVADC_G_SEFLAG;

/** \brief  Source Event Node Pointer Reg., Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_G_SEVNP_Bits B;               /**< \brief Bitfield access */
} Ifx_EVADC_G_SEVNP;

/** \brief  Service Request Software Activation Trigger, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_G_SRACT_Bits B;               /**< \brief Bitfield access */
} Ifx_EVADC_G_SRACT;

/** \brief  Synchronization Control Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_G_SYNCTR_Bits B;              /**< \brief Bitfield access */
} Ifx_EVADC_G_SYNCTR;

/** \brief  Valid Flag Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_G_VFR_Bits B;                 /**< \brief Bitfield access */
} Ifx_EVADC_G_VFR;

/** \brief  Global Boundary Select Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_GLOB_BOUND_Bits B;            /**< \brief Bitfield access */
} Ifx_EVADC_GLOB_BOUND;

/** \brief  Global Event Flag Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_GLOB_EFLAG_Bits B;            /**< \brief Bitfield access */
} Ifx_EVADC_GLOB_EFLAG;

/** \brief  Global Event Node Pointer Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_GLOB_EVNP_Bits B;             /**< \brief Bitfield access */
} Ifx_EVADC_GLOB_EVNP;

/** \brief  Global Result Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_GLOB_RCR_Bits B;              /**< \brief Bitfield access */
} Ifx_EVADC_GLOB_RCR;

/** \brief  Global Result Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_GLOB_RES_Bits B;              /**< \brief Bitfield access */
} Ifx_EVADC_GLOB_RES;

/** \brief  Global Result Register, Debug */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_GLOB_RESD_Bits B;             /**< \brief Bitfield access */
} Ifx_EVADC_GLOB_RESD;

/** \brief  Global Test Enable Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_GLOB_TE_Bits B;               /**< \brief Bitfield access */
} Ifx_EVADC_GLOB_TE;

/** \brief  Global Test Functions Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_GLOB_TF_Bits B;               /**< \brief Bitfield access */
} Ifx_EVADC_GLOB_TF;

/** \brief  Global Configuration Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_GLOBCFG_Bits B;               /**< \brief Bitfield access */
} Ifx_EVADC_GLOBCFG;

/** \brief  Input Class Reg0ster i, Global */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_GLOBICLASS_Bits B;            /**< \brief Bitfield access */
} Ifx_EVADC_GLOBICLASS;

/** \brief  Module Identification Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_ID_Bits B;                    /**< \brief Bitfield access */
} Ifx_EVADC_ID;

/** \brief  Kernel Reset Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_KRST0_Bits B;                 /**< \brief Bitfield access */
} Ifx_EVADC_KRST0;

/** \brief  Kernel Reset Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_KRST1_Bits B;                 /**< \brief Bitfield access */
} Ifx_EVADC_KRST1;

