Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_regdef.h
/** \brief  Kernel Reset Status Clear Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_KRSTCLR_Bits B;               /**< \brief Bitfield access */
} Ifx_EVADC_KRSTCLR;

/** \brief  OCDS Control and Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_OCS_Bits B;                   /**< \brief Bitfield access */
} Ifx_EVADC_OCS;

/** \brief  Queue 0 Register 0, Group 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_G_Q_Q0R_Bits B;                 /**< \brief Bitfield access */
} Ifx_EVADC_G_Q_Q0R;

/** \brief  Queue 0 Source Contr. Register, Group 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_G_Q_QCTRL_Bits B;               /**< \brief Bitfield access */
} Ifx_EVADC_G_Q_QCTRL;

/** \brief  Queue 0 Input Register, Group 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_G_Q_QINR_Bits B;                /**< \brief Bitfield access */
} Ifx_EVADC_G_Q_QINR;

/** \brief  Queue 0 Mode Register, Group 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_G_Q_QMR_Bits B;                 /**< \brief Bitfield access */
} Ifx_EVADC_G_Q_QMR;

/** \brief  Queue 0 Status Register, Group 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_G_Q_QSR_Bits B;                 /**< \brief Bitfield access */
} Ifx_EVADC_G_Q_QSR;

/** \brief  Queue 2 Requ. rigger Control Reg., Group x */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_G_Q2_TRCTR_Bits B;               /**< \brief Bitfield access */
} Ifx_EVADC_G_Q2_TRCTR;

/** \brief  Queue 0 Requ. Timer Mode Reg., Group 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_G_Q_REQTM_Bits B;               /**< \brief Bitfield access */
} Ifx_EVADC_G_Q_REQTM;

/** \brief  Queue 0 Requ. Timer Status Reg., Group 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_G_Q_REQTS_Bits B;               /**< \brief Bitfield access */
} Ifx_EVADC_G_Q_REQTS;

/** \brief  Group Result Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_G_RCR_Bits B;                   /**< \brief Bitfield access */
} Ifx_EVADC_G_RCR;

/** \brief  Group Result Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_G_RES_Bits B;                   /**< \brief Bitfield access */
} Ifx_EVADC_G_RES;

/** \brief  Group Result Reg., Debug */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_EVADC_G_RESD_Bits B;                  /**< \brief Bitfield access */
} Ifx_EVADC_G_RESD;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Evadc_struct
 * \{  */
/******************************************************************************/
/** \name Object L2
 * \{  */

/** \brief  Queue objects */
typedef volatile struct _Ifx_EVADC_G_Q
{
    Ifx_EVADC_G_Q_QCTRL QCTRL;                /**< \brief 0, Queue 0 Source Contr. Register, Group 0 */
    Ifx_EVADC_G_Q_QMR QMR;                    /**< \brief 4, Queue 0 Mode Register, Group 0 */
    Ifx_EVADC_G_Q_QSR QSR;                    /**< \brief 8, Queue 0 Status Register, Group 0 */
    Ifx_EVADC_G_Q_Q0R Q0R;                    /**< \brief C, Queue 0 Register 0, Group 0 */
    Ifx_EVADC_G_Q_QINR QINR;                  /**< \brief 10, Queue 0 Input Register, Group 0 */
    unsigned char reserved_14[4];           /**< \brief 14, \internal Reserved */
    Ifx_EVADC_G_Q_REQTM REQTM;                /**< \brief 18, Queue 0 Requ. Timer Mode Reg., Group 0 */
    Ifx_EVADC_G_Q_REQTS REQTS;                /**< \brief 1C, Queue 0 Requ. Timer Status Reg., Group 0 */
} Ifx_EVADC_G_Q;

/** \brief  Queue objects */
typedef volatile struct _Ifx_EVADC_G_Q2
{
    Ifx_EVADC_G_Q_QCTRL QCTRL;                /**< \brief 0, Queue 0 Source Contr. Register, Group 0 */
    Ifx_EVADC_G_Q_QMR QMR;                    /**< \brief 4, Queue 0 Mode Register, Group 0 */
    Ifx_EVADC_G_Q_QSR QSR;                    /**< \brief 8, Queue 0 Status Register, Group 0 */
    Ifx_EVADC_G_Q_Q0R Q0R;                    /**< \brief C, Queue 0 Register 0, Group 0 */
    Ifx_EVADC_G_Q_QINR QINR;                  /**< \brief 10, Queue 0 Input Register, Group 0 */
    Ifx_EVADC_G_Q2_TRCTR TRCTR;                 /**< \brief 14, \internal Reserved */
    Ifx_EVADC_G_Q_REQTM REQTM;                /**< \brief 18, Queue 0 Requ. Timer Mode Reg., Group 0 */
    Ifx_EVADC_G_Q_REQTS REQTS;                /**< \brief 1C, Queue 0 Requ. Timer Status Reg., Group 0 */
} Ifx_EVADC_G_Q2;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Evadc_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */

