Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_regdef.h
/** \brief  Fast Compare Group objects */
typedef volatile struct _Ifx_EVADC_FCG
{
    Ifx_EVADC_FCG_FCCTRL FCCTRL;            /**< \brief 0, Fast Compare Control Register, Group  */
    Ifx_EVADC_FCG_FCM FCM;                  /**< \brief 4, Fast Compare Mode Register, Group  */
    Ifx_EVADC_FCG_FCRAMP0 FCRAMP0;          /**< \brief 8, Fast Compare Ramp Register 0, Group  */
    Ifx_EVADC_FCG_FCRAMP1 FCRAMP1;          /**< \brief C, Fast Compare Ramp Register 1, Group  */
    unsigned char reserved_10[16];          /**< \brief 10, \internal Reserved */
    Ifx_EVADC_FCG_FCBFL FCBFL;              /**< \brief 20, Boundary Flag Register, Group  */
    Ifx_EVADC_FCG_FCHYST FCHYST;            /**< \brief 24, Fast Comp. Hysteresis Register, Group  */
    unsigned char reserved_28[216];         /**< \brief 28, \internal Reserved */
} Ifx_EVADC_FCG;

/** \brief  Group objects */
typedef volatile struct _Ifx_EVADC_G
{
    unsigned char reserved_0[128];          /**< \brief 0, \internal Reserved */
    Ifx_EVADC_G_ARBCFG ARBCFG;              /**< \brief 80, Arbitration Config. Register, Group  */
    Ifx_EVADC_G_ARBPR ARBPR;                /**< \brief 84, Arbitration Priority Register, Group  */
    Ifx_EVADC_G_ANCFG ANCFG;                /**< \brief 88, Analog Fct. Config. Register, Group  */
    unsigned char reserved_8C[20];          /**< \brief 8C, \internal Reserved */
    Ifx_EVADC_G_ICLASS ICLASS[2];           /**< \brief A0, Input Class Reg0ster i, Group  */
    unsigned char reserved_A8[8];           /**< \brief A8, \internal Reserved */
    Ifx_EVADC_G_ALIAS ALIAS;                /**< \brief B0, Alias Register, Group  */
    unsigned char reserved_B4[4];           /**< \brief B4, \internal Reserved */
    Ifx_EVADC_G_BOUND BOUND;                /**< \brief B8, Boundary Select Register, Group  */
    unsigned char reserved_BC[4];           /**< \brief BC, \internal Reserved */
    Ifx_EVADC_G_SYNCTR SYNCTR;              /**< \brief C0, Synchronization Control Register, Group  */
    unsigned char reserved_C4[60];          /**< \brief C4, \internal Reserved */
    Ifx_EVADC_G_Q Q[2];                     /**< \brief 100, Queue objects */
    Ifx_EVADC_G_Q2 Q2;                      /**< \brief 140, Queue objects */
    unsigned char reserved_160[32];         /**< \brief 160, \internal Reserved */
    Ifx_EVADC_G_CEFLAG CEFLAG;              /**< \brief 180, Channel Event Flag Register, Group  */
    Ifx_EVADC_G_REFLAG REFLAG;              /**< \brief 184, Result Event Flag Register, Group  */
    Ifx_EVADC_G_SEFLAG SEFLAG;              /**< \brief 188, Source Event Flag Register, Group  */
    unsigned char reserved_18C[4];          /**< \brief 18C, \internal Reserved */
    Ifx_EVADC_G_CEFCLR CEFCLR;              /**< \brief 190, Channel Event Flag Clear Register, Group  */
    Ifx_EVADC_G_REFCLR REFCLR;              /**< \brief 194, Result Event Flag Clear Register, Group  */
    Ifx_EVADC_G_SEFCLR SEFCLR;              /**< \brief 198, Source Event Flag Clear Reg., Group  */
    unsigned char reserved_19C[4];          /**< \brief 19C, \internal Reserved */
    Ifx_EVADC_G_CEVNP0 CEVNP0;              /**< \brief 1A0, Channel Event Node Pointer Reg. 0, Group  */
    Ifx_EVADC_G_CEVNP1 CEVNP1;                 /**< \brief 1A4, Channel Event Node Pointer Register 1, Group ${i}*/
    unsigned char      reserved_1A8[8];        /**< \brief 1A8, \internal Reserved */
    Ifx_EVADC_G_REVNP0 REVNP0;              /**< \brief 1B0, Result Event Node Pointer Reg. 0, Group  */
    Ifx_EVADC_G_REVNP1 REVNP1;              /**< \brief 1B4, Result Event Node Pointer Reg. 1, Group  */
    unsigned char reserved_1B8[8];          /**< \brief 1B8, \internal Reserved */
    Ifx_EVADC_G_SEVNP SEVNP;                /**< \brief 1C0, Source Event Node Pointer Reg., Group  */
    unsigned char reserved_1C4[4];          /**< \brief 1C4, \internal Reserved */
    Ifx_EVADC_G_SRACT SRACT;                /**< \brief 1C8, Service Request Software Activation Trigger, Group  */
    unsigned char reserved_1CC[36];         /**< \brief 1CC, \internal Reserved */
    Ifx_EVADC_G_EMUXCTR EMUXCTR;            /**< \brief 1F0, External Multiplexer Control Reg., Group  */
    Ifx_EVADC_G_EMUXCS EMUXCS;              /**< \brief 1F4, Ext. Multiplexer Channel Select Reg., Group  */
    Ifx_EVADC_G_VFR VFR;                    /**< \brief 1F8, Valid Flag Register, Group  */
    unsigned char reserved_1FC[4];          /**< \brief 1FC, \internal Reserved */
    Ifx_EVADC_G_CHCTR CHCTR[16];              /**< \brief 200, Group, Channel Control Register */
    unsigned char reserved_240[64];         /**< \brief 240, \internal Reserved */
    Ifx_EVADC_G_RCR RCR[16];                  /**< \brief 280, Group Result Control Register */
    unsigned char reserved_2C0[64];         /**< \brief 2C0, \internal Reserved */
    Ifx_EVADC_G_RES RES[16];                  /**< \brief 300, Group Result Register */
    unsigned char reserved_340[64];         /**< \brief 340, \internal Reserved */
    Ifx_EVADC_G_RESD RESD[16];                /**< \brief 380, Group Result Reg., Debug */
    unsigned char reserved_3C0[64];         /**< \brief 3C0, \internal Reserved */
} Ifx_EVADC_G;

/** \brief  GLOB Objects */
typedef volatile struct _Ifx_EVADC_GLOB
{
    Ifx_EVADC_GLOBICLASS ICLASS[2];         /**< \brief 0, Input Class Reg0ster i, Global */
    unsigned char reserved_8[16];           /**< \brief 8, \internal Reserved */
    Ifx_EVADC_GLOB_BOUND BOUND;             /**< \brief 18, Global Boundary Select Register */
    unsigned char reserved_1C[36];          /**< \brief 1C, \internal Reserved */
    Ifx_EVADC_GLOB_EFLAG EFLAG;             /**< \brief 40, Global Event Flag Register */
    unsigned char reserved_44[92];          /**< \brief 44, \internal Reserved */
    Ifx_EVADC_GLOB_EVNP EVNP;               /**< \brief A0, Global Event Node Pointer Register */
    unsigned char reserved_A4[28];          /**< \brief A4, \internal Reserved */
    Ifx_EVADC_GLOB_TF TF;                   /**< \brief C0, Global Test Functions Register */
    Ifx_EVADC_GLOB_TE TE;                   /**< \brief C4, Global Test Enable Register */
    unsigned char reserved_C8[280];         /**< \brief C8, \internal Reserved */
    Ifx_EVADC_GLOB_RCR RCR;                 /**< \brief 1E0, Global Result Control Register */
    unsigned char reserved_1E4[124];        /**< \brief 1E4, \internal Reserved */
    Ifx_EVADC_GLOB_RES RES;                 /**< \brief 260, Global Result Register */
    unsigned char reserved_264[124];        /**< \brief 264, \internal Reserved */
    Ifx_EVADC_GLOB_RESD RESD;               /**< \brief 2E0, Global Result Register, Debug */
} Ifx_EVADC_GLOB;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Evadc_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \brief  EVADC object */
typedef volatile struct _Ifx_EVADC
{
    Ifx_EVADC_CLC CLC;                      /**< \brief 0, Clock Control Register */
    unsigned char reserved_4[4];            /**< \brief 4, \internal Reserved */
    Ifx_EVADC_ID ID;                        /**< \brief 8, Module Identification Register */
    unsigned char reserved_C[28];           /**< \brief C, \internal Reserved */
    Ifx_EVADC_OCS OCS;                      /**< \brief 28, OCDS Control and Status Register */
    Ifx_EVADC_KRSTCLR KRSTCLR;              /**< \brief 2C, Kernel Reset Status Clear Register */
    Ifx_EVADC_KRST1 KRST1;                  /**< \brief 30, Kernel Reset Register 1 */
    Ifx_EVADC_KRST0 KRST0;                  /**< \brief 34, Kernel Reset Register 0 */
    Ifx_EVADC_ACCEN1 ACCEN1;                /**< \brief 38, Access Enable Register 1 */
    Ifx_EVADC_ACCEN0 ACCEN0;                /**< \brief 3C, Access Enable Register 0 */
    unsigned char reserved_40[64];          /**< \brief 40, \internal Reserved */
    Ifx_EVADC_GLOBCFG GLOBCFG;              /**< \brief 80, Global Configuration Register */
    unsigned char reserved_84[4];           /**< \brief 84, \internal Reserved */
    Ifx_EVADC_ACCPROT0 ACCPROT0;            /**< \brief 88, Access Protection Register 0 */
    Ifx_EVADC_ACCPROT1 ACCPROT1;            /**< \brief 8C, Access Protection Register 1 */
    Ifx_EVADC_ACCPROT2 ACCPROT2;            /**< \brief 90, Access Protection Register 2 */
    unsigned char reserved_94[12];          /**< \brief 94, \internal Reserved */
    Ifx_EVADC_GLOB GLOB;                    /**< \brief A0, GLOB Objects */
    unsigned char reserved_384[108];        /**< \brief 384, \internal Reserved */
    Ifx_EVADC_EMUXSEL EMUXSEL;              /**< \brief 3F0, External Multiplexer Interface Select Register */
    unsigned char reserved_3F4[12];         /**< \brief 3F4, \internal Reserved */
    Ifx_EVADC_G G[12];                      /**< \brief 400, Group objects */
    Ifx_EVADC_FCG FCG[8];                   /**< \brief 3400, Fast Compare Group objects */
    unsigned char reserved_3C00[1024];      /**< \brief 3C00, \internal Reserved */
} Ifx_EVADC;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXEVADC_REGDEF_H */
